//1. Выведите в консоль результат деления числа 100 на 4.
let a = 100;
let b = 4;
console.log (a/b);

// 2. Реализуйте программу, которая вычисляет и выводит на экран значение выражения: 8 / 2 + 5 - -3 / 2
let sum = (8 / 2 + 5 - -3 / 2);
console.log (sum);

//3.Выведите в консоль следующую фразу, используя конкатенацию: Lorem ipsum dolor sit amet
console.log ('lorem' + ' ' + 'ipsum' + ' ' + 'dolor' + ' ' + 'ipsum' + ' ' + 'sit');

//4. Создайте переменную number и присвойте ей значение 8. Затем переопределите значение - задайте новое значение 15. Выведите новое значение переменной в консоль.
let a1 = 8;
 a1 = 15;
 console.log (a1);

// 6. Создайте переменную sum, которая будет выполнять операцию возведения в квадрат числа 8. Выведите переменную sum в консоль.
//the first variant:
let sum1 = Math.pow(8, 2);
console.log (sum1);

//the second variant:
let sum2 = 8;
console.log (sum2**2);


// 7. Создайте две переменные firstname и lastname. Присвойте им произвольные значения. Выведите в консоль строку в формате ‘Имя Фамилия’

let firstname = 'Mary';
let lastname = 'Pincher';
console.log (`${firstname} ${lastname}`);


